"""
Є декілька мережевих кабелів різної довжини, їх потрібно об'єднати по два за раз в один кабель, 
використовуючи з'єднувачі, у порядку, який призведе до найменших витрат. 
Витрати на з'єднання двох кабелів дорівнюють їхній сумі довжин, а загальні витрати дорівнюють 
сумі з'єднання всіх кабелів.
Завдання полягає в тому, щоб знайти порядок об'єднання, який мінімізує загальні витрати.
"""

# Найменші загальні витати, якщо завжди об'єднувати два найкоротших кабелі на кожному кроці. 

import heapq

def cable_connection(cables):
    # Створюємо мінімальну купу
    heap = []
    for cable in cables:
        heapq.heappush(heap, cable)
    
    # Витягуємо елементи впорядковано, для з'єднання
    print("Купа кабелів:", heap)
    while len(heap) > 1:
        a = heapq.heappop(heap)
        b = heapq.heappop(heap)
        ab = a + b
        print(f"З'єднуємо кабелі {a} та {b}, отримуємо {ab} та кладемо його до купи {heap}")
        heapq.heappush(heap, ab)
        print("У купі:", heap)
    # Повертаємо останній об'єднаний кабель з купи
    return heapq.heappop(heap)

cables = [4, 7, 1, 10, 3]
connected_cable = cable_connection(cables)


print("Загальні витрати на з'єднання:", connected_cable)